<b><font size="5">Pandas Data Structures, Indexing and Slicing.</font><a class="anchor"><a id='toc'></a></b><br>

# <font color='#E8800A'>Exercises</font><a class="anchor" id="sixteenth-bullet"></a>

 **Exercise 0:** Create a Pandas Series, insert values and name it.

In [90]:
import pandas as pd
pd?

In [22]:
# Create a variable named 'my_series' of type Pandas Series
my_series = pd.Series(dtype=int)

In [35]:
# Insert [2021, 2022, 2023, 2024, 2025] into 'my_series'
dir(my_series)
my_series = my_series.append(pd.Series([2021,2022,2023,2024,2025]))

C:\Users\meng4\AppData\Local\Temp\ipykernel_26500\1639414436.py:3: FutureWarning: The series.append method is deprecated and will be removed from pandas in a future version. Use pandas.concat instead.
  my_series = my_series.append(pd.Series([2021,2022,2023,2024,2025]))

In [36]:
# Define 'my_series' name as 'start'
my_series

my_series.name = 'start'

my_series

0    2021
1    2022
2    2023
3    2024
4    2025
0    2021
1    2022
2    2023
3    2024
4    2025
Name: start, dtype: int64

 **Exercise 1:** Create a Pandas DataFrame and insert values.

In [29]:
# Create a variable named 'my_DF' of type Pandas DataFrame with 'my_series'
my_DF = pd.DataFrame(my_series)

In [30]:
# Add column with academic end year, this is: [22, 23, 24, 25, 26] named as 'end'

my_DF['end'] = [22,23,24,25,26]
my_DF

   start  end
0   2021   22
1   2022   23
2   2023   24
3   2024   25
4   2025   26

In [31]:
# Change 'end' to present the 4-digit year
my_DF['end'] = 2000 + my_DF['end']
my_DF

   start   end
0   2021  2022
1   2022  2023
2   2023  2024
3   2024  2025
4   2025  2026

 **Exercise 2:** Change Pandas DataFrame index.

In [43]:
# Label 'my_DF' index with [year_1, year_2, year_3, year_4, year_5]
my_DF.index = ['year_1', 'year_2', 'year_3', 'year_4', 'year_5']

my_DF

        start   end
year_1   2021  2022
year_2   2022  2023
year_3   2023  2024
year_4   2024  2025
year_5   2025  2026

 **Exercise 3:** Pandas DataFrame slicing.

Object `np.array.reshape` not found.

In [94]:
# Create a Pandas DataFrame with 5 rows and 6 columns full of positive random numbers [0,1). Label columns as c1, c2... 
import numpy as np
np.random.seed(0)
X = np.random.random(5*6).reshape(5,6)
A = pd.DataFrame(X)
A.columns = [f'c{i}' for i in range(1, 7)]
A

         c1        c2        c3        c4        c5        c6
0  0.548814  0.715189  0.602763  0.544883  0.423655  0.645894
1  0.437587  0.891773  0.963663  0.383442  0.791725  0.528895
2  0.568045  0.925597  0.071036  0.087129  0.020218  0.832620
3  0.778157  0.870012  0.978618  0.799159  0.461479  0.780529
4  0.118274  0.639921  0.143353  0.944669  0.521848  0.414662

In [95]:
# Select column c5 with Series output
A.c5

0    0.423655
1    0.791725
2    0.020218
3    0.461479
4    0.521848
Name: c5, dtype: float64

In [96]:
# Select column c5 with DataFrame output
A.iloc[:, 4:5]     
# smarter: A[['...']] -> double list

         c5
0  0.423655
1  0.791725
2  0.020218
3  0.461479
4  0.521848

In [97]:
# Select first 2 rows
A.iloc[:2, :]

         c1        c2        c3        c4        c5        c6
0  0.548814  0.715189  0.602763  0.544883  0.423655  0.645894
1  0.437587  0.891773  0.963663  0.383442  0.791725  0.528895

In [98]:
# Select first 4 rows of c4
A.loc[:4, 'c4']

0    0.544883
1    0.383442
2    0.087129
3    0.799159
4    0.944669
Name: c4, dtype: float64

In [101]:
# Slice using integer location (iloc): first 3 rows using postive indexing and last 3 columns using negative indexing
print(A.iloc[:3, -3:])

         c4        c5        c6
0  0.544883  0.423655  0.645894
1  0.383442  0.791725  0.528895
2  0.087129  0.020218  0.832620

 **Exercise 4:** Create a MultiIndex DataFrame.

In [171]:
# Create a MultiIndexing from DataFrame with 3 levels (year, semester, UC) each with 2 entries 
# [(year_1, semester_1, UC_1), (year_1, semester_1, UC_2)...
import pandas as pd

L = []
n = 1
for i in range(1, 2+1):
    for j in range(1,2+1):
        for k in range(1,2+1):
            L.append([f"year_{i}", f"semester_{j}", f"UC_{n}"])
            n+=1
            
multi = pd.DataFrame(
    data = L,
    columns = ['year', 'semester', 'UC']
)

M_index = pd.MultiIndex.from_frame(multi)

In [172]:
# Create a DataFrame from previous MultiIndexing with grades for 3 students
# Note: you can random generate grades using 'np.random.randint(21,size=(8,3))'
import numpy as np 
np.random.seed(5)
S = pd.DataFrame(data=np.random.randint(21, size=(8,3)), index=M_index)

S.columns = ["Student1", "Student2", "Student3"]
S

                        Student1  Student2  Student3
year   semester   UC
year_1 semester_1 UC_1         3        14        15
                  UC_2         6        16         9
       semester_2 UC_3         8         4         7
                  UC_4        16        16         7
year_2 semester_1 UC_5        12        15        17
                  UC_6         7        16        12
       semester_2 UC_7        13        11         1
                  UC_8        15        20        18

 **Exercise 5:** MultiIndex DataFrame slicing.

In [164]:
# Slice the grades in fisrt semester of seconf year

my_slice = S.loc['year_2', 'semester_1']
my_slice

      Student1  Student2  Student3
UC
UC_5        12        15        17
UC_6         7        16        12

In [165]:
# Following previous slice, present the last 2 students grades
my_slice[['Student2', 'Student3']]

      Student2  Student3
UC
UC_5        15        17
UC_6        16        12

 **Exercise 6:** Change the name of 'UC_5' to 'PDS'.

In [170]:
# Check documentation on pandas.DataFrame.rename (https://pandas.pydata.org/docs/reference/api/pandas.DataFrame.rename.html)
def rename(x):
    if x == 'UC_5':
        return 'PDS'
    else:
        return x

my_slice.rename(rename, axis=0)

      Student1  Student2  Student3
UC
PDS         12        15        17
UC_6         7        16        12

 **Exercise 7:** Change DataFrame MultiIndex.

In [167]:
# Keep only idx_1 and idx_3, without keeping idx_2 in the DataFrame
S_new = S.copy()
S_new = S_new.droplevel(1)
S_new

             Student1  Student2  Student3
year   UC
year_1 UC_1         3        14        15
       UC_2         6        16         9
       UC_3         8         4         7
       UC_4        16        16         7
year_2 UC_5        12        15        17
       UC_6         7        16        12
       UC_7        13        11         1
       UC_8        15        20        18

 **Exercise 8:** Filter DataFrame with functions.

In [168]:
# Filter grades from year 2 that are higher than 8, using where().
year_2 = S.loc['year_2']
year_2.where(year_2 > 8)

                 Student1  Student2  Student3
semester   UC
semester_1 UC_5      12.0        15      17.0
           UC_6       NaN        16      12.0
semester_2 UC_7      13.0        11       NaN
           UC_8      15.0        20      18.0

In [169]:
# Filter rows from year 2 where student_3 had higher than 8, using query().
year_2.query("Student3 > 8")

                 Student1  Student2  Student3
semester   UC
semester_1 UC_5        12        15        17
           UC_6         7        16        12
semester_2 UC_8        15        20        18